Config/Documents/СписаниеДопРасходовУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеДопРасходовУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетДолейСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеМЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаноСуммаУСН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаноСуммаНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаноСуммаЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСписанияУСН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСписанияНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСписанияЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопРасходыУСН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыУСН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РасходыУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Документ оплаты (УСН)</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаУСНСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаУСНСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаУСНСуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаУСНСуммаНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаУСНСуммаЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаНеУчитываемыеСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаНеУчитываемыеСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаНеУчитываемыеСуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаНеУчитываемыеСуммаНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаНеУчитываемыеСуммаЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаЕНВДСуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаЕНВДСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаЕНВДСуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаЕНВДСуммаНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаЕНВДСуммаЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыРасходовУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасходовУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
					<Comment>НДС по приобретенным ценностям</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СписаниеДопРасходовУСН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДействующиеИд = РасчетДолейСписания.ВыгрузитьКолонку("ИдСтроки");
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаДопРасходов Из ДопРасходыУСН Цикл
		Если ДействующиеИд.Найти(СтрокаДопРасходов.ИдСтроки) = Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрокаДопРасходов);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрока Из СтрокиКУдалению Цикл
		ДопРасходыУСН.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

// Заполняет документ остатками затрат по счетам учета затрат
//
Процедура ЗаполнитьДокумент(ПараметрыЗаполнения) Экспорт

	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("Дата",        Дата);
	ПараметрыЗаполнения.Вставить("Ссылка",      Ссылка);
	
	ПараметрыЗаполнения.Вставить("ПоВсемИФО", Истина);
	
	// Формируем запрос по остаткам доп. расходов к списанию.
	СчетаДопРасходовКСписанию = БухгалтерскийУчет.СписокСчетов(
		"У15.С,У15.СО");
	
	ПериодОстатков = ?(ПараметрыЗаполнения.Свойство("ПериодОстатков"), ПараметрыЗаполнения.ПериодОстатков,
		Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая));
	ОстаткиДопРасходов = УчетУСН.ОстаткиРасходовУСН(ПериодОстатков, СчетаДопРасходовКСписанию,
		Новый Структура("ВидРасхода", Перечисления.ВидыРасходовУСН.ДопРасходы), ПараметрыЗаполнения);
	
	// Формируем запрос по начальным остаткам и списанниям материальных запасов за квартал.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыУСН.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РасходыУСН
	|ИЗ
	|	Справочник.РасходыУСН КАК РасходыУСН
	|ГДЕ
	|	РасходыУСН.ВидРасхода = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовУСН.МатериальныеЗапасы)
	|	И РасходыУСН.ЭлементРасхода В(&НоменклатураЗапасовСДопРасходами)
	|	И РасходыУСН.Партия В(&ПартииЗапасовСДопРасходами)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОборотыДтКт.ИФО КАК ИФО,
	|	ЕПСБУОборотыДтКт.КФО КАК КФО,
	|	ЕСТЬNULL(ЕПСБУОборотыДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(ЕПСБУОборотыДтКт.ПодразделениеДт, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕПСБУОборотыДтКт.СчетДт КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОборотыДтКт.СубконтоДт1 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОборотыДтКт.КоличествоОборотДт КАК ПоступилоКоличество,
	|	ЕПСБУОборотыДтКт.СуммаОборот КАК ПоступилоСумма,
	|	ЕПСБУОборотыДтКт.СуммаНеУчитываетсяНУОборот КАК ПоступилоСуммаНеУчитываетсяНУ,
	|	ЕПСБУОборотыДтКт.СуммаЕНВДОборот КАК ПоступилоСуммаЕНВД,
	|	ЕПСБУОборотыДтКт.СуммаНДСОборот КАК ПоступилоСуммаНДС
	|ПОМЕСТИТЬ ПоступлениеМатериальныхЗапасов
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В (&СчетаНеСписанныхРасходовУСН),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.РасходыУСН),
	|			СчетКт В (&СчетаПоступленияРасходовУСН),
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						РасходыУСН.Ссылка
	|					ИЗ
	|						РасходыУСН)) КАК ЕПСБУОборотыДтКт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Подразделение,
	|	Счет,
	|	РасходыУСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОборотыДтКт.ИФО КАК ИФО,
	|	ЕПСБУОборотыДтКт.КФО КАК КФО,
	|	ЕСТЬNULL(ЕПСБУОборотыДтКт.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(ЕПСБУОборотыДтКт.ПодразделениеКт, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕПСБУОборотыДтКт.СчетКт КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОборотыДтКт.СубконтоКт1 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОборотыДтКт.КоличествоОборотКт КАК СписаноКоличество,
	|	ЕПСБУОборотыДтКт.СуммаОборот КАК СписаноСумма,
	|	ЕПСБУОборотыДтКт.СуммаНеУчитываетсяНУОборот КАК СписаноСуммаНеУчитываетсяНУ,
	|	ЕПСБУОборотыДтКт.СуммаЕНВДОборот КАК СписаноСуммаЕНВД,
	|	ЕПСБУОборотыДтКт.СуммаНДСОборот КАК СписаноСуммаНДС
	|ПОМЕСТИТЬ СписаниеМатериальныхЗапасов
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В (&СчетаСписанныхРасходовУСН),
	|			,
	|			СчетКт В (&СчетаНеСписанныхРасходовУСН),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.РасходыУСН),
	|			Организация = &Организация
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						РасходыУСН.Ссылка
	|					ИЗ
	|						РасходыУСН)) КАК ЕПСБУОборотыДтКт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Подразделение,
	|	Счет,
	|	РасходыУСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.ИФО КАК ИФО,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕСТЬNULL(ЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(ЕПСБУОстатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОстатки.КоличествоОстаток КАК ОстатокКоличество,
	|	ЕПСБУОстатки.СуммаОстаток КАК ОстатокСумма,
	|	ЕПСБУОстатки.СуммаНеУчитываетсяНУОстаток КАК ОстатокСуммаНеУчитываетсяНУ,
	|	ЕПСБУОстатки.СуммаЕНВДОстаток КАК ОстатокСуммаЕНВД,
	|	ЕПСБУОстатки.СуммаНДСОстаток КАК ОстатокСуммаНДС
	|ПОМЕСТИТЬ ОстаткиМатериальныхЗапасов
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&НачалоПериода,
	|			Счет В (&СчетаНеСписанныхРасходовУСН),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.РасходыУСН),
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						РасходыУСН.Ссылка
	|					ИЗ
	|						РасходыУСН)) КАК ЕПСБУОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Подразделение,
	|	Счет,
	|	РасходыУСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеМатериальныхЗапасов.ИФО,
	|	СписаниеМатериальныхЗапасов.КФО,
	|	СписаниеМатериальныхЗапасов.КПС,
	|	СписаниеМатериальныхЗапасов.Подразделение,
	|	СписаниеМатериальныхЗапасов.Счет КАК СчетУчета,
	|	СписаниеМатериальныхЗапасов.РасходыУСН,
	|	СписаниеМатериальныхЗапасов.РасходыУСН.Наименование КАК НаименованиеЭлементаРасходов,
	|	ВЫРАЗИТЬ(СписаниеМатериальныхЗапасов.РасходыУСН.ЭлементРасхода КАК Справочник.Номенклатура) КАК Номенклатура,
	|	СписаниеМатериальныхЗапасов.РасходыУСН.Партия КАК Партия,
	|	ЕСТЬNULL(ОстаткиМатериальныхЗапасов.ОстатокКоличество, 0) КАК ОстатокКоличество,
	|	ЕСТЬNULL(ОстаткиМатериальныхЗапасов.ОстатокСумма, 0) КАК ОстатокСумма,
	|	ЕСТЬNULL(ОстаткиМатериальныхЗапасов.ОстатокСуммаНеУчитываетсяНУ, 0) КАК ОстатокСуммаНеУчитываетсяНУ,
	|	ЕСТЬNULL(ОстаткиМатериальныхЗапасов.ОстатокСуммаЕНВД, 0) КАК ОстатокСуммаЕНВД,
	|	ЕСТЬNULL(ОстаткиМатериальныхЗапасов.ОстатокСуммаНДС, 0) КАК ОстатокСуммаНДС,
	|	ЕСТЬNULL(ПоступлениеМатериальныхЗапасов.ПоступилоКоличество, 0) КАК ПоступилоКоличество,
	|	ЕСТЬNULL(ПоступлениеМатериальныхЗапасов.ПоступилоСумма, 0) КАК ПоступилоСумма,
	|	ЕСТЬNULL(ПоступлениеМатериальныхЗапасов.ПоступилоСуммаНеУчитываетсяНУ, 0) КАК ПоступилоСуммаНеУчитываетсяНУ,
	|	ЕСТЬNULL(ПоступлениеМатериальныхЗапасов.ПоступилоСуммаЕНВД, 0) КАК ПоступилоСуммаЕНВД,
	|	ЕСТЬNULL(ПоступлениеМатериальныхЗапасов.ПоступилоСуммаНДС, 0) КАК ПоступилоСуммаНДС,
	|	СписаниеМатериальныхЗапасов.СписаноКоличество,
	|	СписаниеМатериальныхЗапасов.СписаноСумма,
	|	СписаниеМатериальныхЗапасов.СписаноСуммаНеУчитываетсяНУ,
	|	СписаниеМатериальныхЗапасов.СписаноСуммаЕНВД,
	|	СписаниеМатериальныхЗапасов.СписаноСуммаНДС
	|ИЗ
	|	СписаниеМатериальныхЗапасов КАК СписаниеМатериальныхЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеМатериальныхЗапасов КАК ПоступлениеМатериальныхЗапасов
	|		ПО СписаниеМатериальныхЗапасов.ИФО = ПоступлениеМатериальныхЗапасов.ИФО
	|			И СписаниеМатериальныхЗапасов.КФО = ПоступлениеМатериальныхЗапасов.КФО
	|			И СписаниеМатериальныхЗапасов.КПС = ПоступлениеМатериальныхЗапасов.КПС
	|			И СписаниеМатериальныхЗапасов.Подразделение = ПоступлениеМатериальныхЗапасов.Подразделение
	|			И СписаниеМатериальныхЗапасов.РасходыУСН = ПоступлениеМатериальныхЗапасов.РасходыУСН
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиМатериальныхЗапасов КАК ОстаткиМатериальныхЗапасов
	|		ПО СписаниеМатериальныхЗапасов.ИФО = ОстаткиМатериальныхЗапасов.ИФО
	|			И СписаниеМатериальныхЗапасов.КФО = ОстаткиМатериальныхЗапасов.КФО
	|			И СписаниеМатериальныхЗапасов.КПС = ОстаткиМатериальныхЗапасов.КПС
	|			И СписаниеМатериальныхЗапасов.Подразделение = ОстаткиМатериальныхЗапасов.Подразделение
	|			И СписаниеМатериальныхЗапасов.РасходыУСН = ОстаткиМатериальныхЗапасов.РасходыУСН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партия,
	|	НаименованиеЭлементаРасходов";
	
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоКвартала(Дата));
	Запрос.УстановитьПараметр("КонецПериода",   Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",    Организация);
	
	Запрос.УстановитьПараметр("СчетаПоступленияРасходовУСН",
		БухгалтерскийУчет.СписокСчетов("УСН") );
	Запрос.УстановитьПараметр("СчетаСписанныхРасходовУСН",
		БухгалтерскийУчет.СписокСчетов("У10.О,У10.Р,У41.О,У41.Р,У99") );
	Запрос.УстановитьПараметр("СчетаНеСписанныхРасходовУСН",
		БухгалтерскийУчет.СписокСчетов("У10.С,У10.СО,У10.СП,У41.С,У41.СО,У41.СП") );
	
	Запрос.УстановитьПараметр("НоменклатураЗапасовСДопРасходами",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОстаткиДопРасходов.ВыгрузитьКолонку("ЭлементРасхода")) );
	Запрос.УстановитьПараметр("ПартииЗапасовСДопРасходами",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОстаткиДопРасходов.ВыгрузитьКолонку("СубконтоРасходов2")) );
	
	ДвижениеМатериальныхЗапасов = Запрос.Выполнить().Выгрузить();
	ДвижениеМатериальныхЗапасов.Свернуть("ИФО,КФО,КПС,Подразделение,Номенклатура,Партия",
		"ОстатокКоличество,ОстатокСумма,ОстатокСуммаНеУчитываетсяНУ,ОстатокСуммаЕНВД,ОстатокСуммаНДС,
		|ПоступилоКоличество,ПоступилоСумма,ПоступилоСуммаНеУчитываетсяНУ,ПоступилоСуммаЕНВД,ПоступилоСуммаНДС,
		|СписаноКоличество,СписаноСумма,СписаноСуммаНеУчитываетсяНУ,СписаноСуммаЕНВД,СписаноСуммаНДС");
	
	// Заполняем табличные части документа
	
	Для Каждого МатериальныеЗапасы Из ДвижениеМатериальныхЗапасов Цикл
		
		НоваяСтрока = РасчетДолейСписания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, МатериальныеЗапасы);
		НоваяСтрока.ИдСтроки = РасчетДолейСписания.Количество();
		
		НоваяСтрока.ОстатокСумма =
			  МатериальныеЗапасы.ОстатокСумма
			+ МатериальныеЗапасы.ОстатокСуммаНДС
			+ МатериальныеЗапасы.ОстатокСуммаНеУчитываетсяНУ
			+ МатериальныеЗапасы.ОстатокСуммаЕНВД
			+ МатериальныеЗапасы.ПоступилоСумма
			+ МатериальныеЗапасы.ПоступилоСуммаНДС
			+ МатериальныеЗапасы.ПоступилоСуммаНеУчитываетсяНУ
			+ МатериальныеЗапасы.ПоступилоСуммаЕНВД;
		
		НоваяСтрока.СписаноСуммаУСН             = МатериальныеЗапасы.СписаноСумма + МатериальныеЗапасы.СписаноСуммаНДС;
		НоваяСтрока.СписаноСуммаНеУчитываетсяНУ = МатериальныеЗапасы.СписаноСуммаНеУчитываетсяНУ;
		НоваяСтрока.СписаноСуммаЕНВД            = МатериальныеЗапасы.СписаноСуммаЕНВД;
		
		Если НоваяСтрока.ОстатокСумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Рассчитаем, какую часть доп. расходов нужно списать в этом периоде.
		ДоляСписанияУСН             = НоваяСтрока.СписаноСуммаУСН             / НоваяСтрока.ОстатокСумма;
		ДоляСписанияНеУчитываетсяНУ = НоваяСтрока.СписаноСуммаНеУчитываетсяНУ / НоваяСтрока.ОстатокСумма;
		ДоляСписанияЕНВД            = НоваяСтрока.СписаноСуммаЕНВД            / НоваяСтрока.ОстатокСумма;
		НоваяСтрока.ПроцентСписанияУСН             = ДоляСписанияУСН * 100;
		НоваяСтрока.ПроцентСписанияНеУчитываетсяНУ = ДоляСписанияНеУчитываетсяНУ * 100;
		НоваяСтрока.ПроцентСписанияЕНВД            = ДоляСписанияЕНВД * 100;
		
		// Отбираем доп. расходы, относящиеся к данной партии номенклатуры.
		Отбор = Новый Структура("ИФО,КФО,КПС,Подразделение");
		ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
		Отбор.Вставить("ЭлементРасхода", НоваяСтрока.Номенклатура);
		Отбор.Вставить("СубконтоРасходов2", НоваяСтрока.Партия);
		
		ДопРасходыКСписанию = ОстаткиДопРасходов.НайтиСтроки(Отбор);
		Для Каждого ДопРасходКСписанию Из ДопРасходыКСписанию Цикл
			
			СтрокаДопРасходов = ДопРасходыУСН.Добавить();
			СтрокаДопРасходов.ИдСтроки = НоваяСтрока.ИдСтроки;
			
			СтрокаДопРасходов.СчетУчета  = ДопРасходКСписанию.СчетУчетаУСН;
			СтрокаДопРасходов.РасходыУСН = ДопРасходКСписанию.РасходыУСН;
			СтрокаДопРасходов.Субконто3  = ДопРасходКСписанию.СубконтоРасходов3;
			СтрокаДопРасходов.Валюта     = ?(ЗначениеЗаполнено(ДопРасходКСписанию.Валюта), ДопРасходКСписанию.Валюта,
				БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
			
			СтрокаДопРасходов.ОстатокСуммаВал        = ДопРасходКСписанию.СуммаВал;
			СтрокаДопРасходов.ОстатокСумма           = ДопРасходКСписанию.СуммаРуб;
			СтрокаДопРасходов.ОстатокНДС             = ДопРасходКСписанию.СуммаНДСРуб;
			СтрокаДопРасходов.ОстатокЕНВД            = ДопРасходКСписанию.СуммаЕНВДРуб;
			СтрокаДопРасходов.ОстатокНеУчитываетсяНУ = ДопРасходКСписанию.СуммаНеУчитываетсяНУРуб;
			
			Если ДоляСписанияУСН > 0 Тогда
				
				СтрокаДопРасходов.СписатьНаУСНСуммаВал =
					+ ДоляСписанияУСН * СтрокаДопРасходов.ОстатокСуммаВал;
				СтрокаДопРасходов.СписатьНаУСНСумма =
					+ ДоляСписанияУСН * СтрокаДопРасходов.ОстатокСумма;
				СтрокаДопРасходов.СписатьНаУСНСуммаНДС =
					+ ДоляСписанияУСН * СтрокаДопРасходов.ОстатокНДС;
				СтрокаДопРасходов.СписатьНаУСНСуммаНеУчитываетсяНУ =
					+ ДоляСписанияУСН * СтрокаДопРасходов.ОстатокНеУчитываетсяНУ;
				СтрокаДопРасходов.СписатьНаУСНСуммаЕНВД =
					+ ДоляСписанияУСН * СтрокаДопРасходов.ОстатокЕНВД;
					
			КонецЕсли;
			
			Если ДоляСписанияНеУчитываетсяНУ > 0 Тогда
				
				СтрокаДопРасходов.СписатьНаНеУчитываемыеСуммаВал =
					+ ДоляСписанияНеУчитываетсяНУ * СтрокаДопРасходов.ОстатокСуммаВал;
				СтрокаДопРасходов.СписатьНаНеУчитываемыеСумма =
					+ ДоляСписанияНеУчитываетсяНУ * СтрокаДопРасходов.ОстатокСумма;
				СтрокаДопРасходов.СписатьНаНеУчитываемыеСуммаНДС =
					+ ДоляСписанияНеУчитываетсяНУ * СтрокаДопРасходов.ОстатокНДС;
				СтрокаДопРасходов.СписатьНаНеУчитываемыеСуммаНеУчитываетсяНУ =
					+ ДоляСписанияНеУчитываетсяНУ * СтрокаДопРасходов.ОстатокНеУчитываетсяНУ;
				СтрокаДопРасходов.СписатьНаНеУчитываемыеСуммаЕНВД =
					+ ДоляСписанияНеУчитываетсяНУ * СтрокаДопРасходов.ОстатокЕНВД;
				
			КонецЕсли;
			
			Если ДоляСписанияЕНВД > 0 Тогда
				
				СтрокаДопРасходов.СписатьНаЕНВДСуммаВал =
					+ ДоляСписанияЕНВД * СтрокаДопРасходов.ОстатокСуммаВал;
				СтрокаДопРасходов.СписатьНаЕНВДСумма =
					+ ДоляСписанияЕНВД * СтрокаДопРасходов.ОстатокСумма;
				СтрокаДопРасходов.СписатьНаЕНВДСуммаНДС =
					+ ДоляСписанияЕНВД * СтрокаДопРасходов.ОстатокНДС;
				СтрокаДопРасходов.СписатьНаЕНВДСуммаНеУчитываетсяНУ =
					+ ДоляСписанияЕНВД * СтрокаДопРасходов.ОстатокНеУчитываетсяНУ;
				СтрокаДопРасходов.СписатьНаЕНВДСуммаЕНВД =
					+ ДоляСписанияЕНВД * СтрокаДопРасходов.ОстатокЕНВД;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
